TEAM-RD0105/MasterProject/MasterModel/RD0105FirmwareModel_Config/RTD/include/S32K36_DSPI_MSC_WRAPPER.h
#define DSPI_MCR_DIS_TXF_MASK                DSPI_MSC_MCR_DIS_TXF_MASK
#define DSPI_MCR_DIS_TXF_SHIFT               DSPI_MSC_MCR_DIS_TXF_SHIFT
#define DSPI_MCR_DIS_TXF_WIDTH               DSPI_MSC_MCR_DIS_TXF_WIDTH
#define DSPI_MCR_DIS_TXF(x)                  DSPI_MSC_MCR_DIS_TXF(x)

#define DSPI_MCR_MDIS_MASK                   DSPI_MSC_MCR_MDIS_MASK
#define DSPI_MCR_MDIS_SHIFT                  DSPI_MSC_MCR_MDIS_SHIFT
#define DSPI_MCR_MDIS_WIDTH                  DSPI_MSC_MCR_MDIS_WIDTH
#define DSPI_MCR_MDIS(x)                     DSPI_MSC_MCR_MDIS(x)

#define DSPI_MCR_PCSIS_MASK                  DSPI_MSC_MCR_PCSIS_MASK
#define DSPI_MCR_PCSIS_SHIFT                 DSPI_MSC_MCR_PCSIS_SHIFT
#define DSPI_MCR_PCSIS_WIDTH                 DSPI_MSC_MCR_PCSIS_WIDTH
#define DSPI_MCR_PCSIS(x)                    DSPI_MSC_MCR_PCSIS(x)

#define DSPI_MCR_ROOE_MASK                   DSPI_MSC_MCR_ROOE_MASK
#define DSPI_MCR_ROOE_SHIFT                  DSPI_MSC_MCR_ROOE_SHIFT
#define DSPI_MCR_ROOE_WIDTH                  DSPI_MSC_MCR_ROOE_WIDTH
#define DSPI_MCR_ROOE(x)                     DSPI_MSC_MCR_ROOE(x)

#define DSPI_MCR_FRZ_MASK                    DSPI_MSC_MCR_FRZ_MASK
#define DSPI_MCR_FRZ_SHIFT                   DSPI_MSC_MCR_FRZ_SHIFT
#define DSPI_MCR_FRZ_WIDTH                   DSPI_MSC_MCR_FRZ_WIDTH
#define DSPI_MCR_FRZ(x)                      DSPI_MSC_MCR_FRZ(x)

#define DSPI_MCR_DCONF_MASK                  DSPI_MSC_MCR_DCONF_MASK
#define DSPI_MCR_DCONF_SHIFT                 DSPI_MSC_MCR_DCONF_SHIFT
#define DSPI_MCR_DCONF_WIDTH                 DSPI_MSC_MCR_DCONF_WIDTH
#define DSPI_MCR_DCONF(x)                    DSPI_MSC_MCR_DCONF(x)

#define DSPI_MCR_CONT_SCKE_MASK              DSPI_MSC_MCR_CONT_SCKE_MASK
#define DSPI_MCR_CONT_SCKE_SHIFT             DSPI_MSC_MCR_CONT_SCKE_SHIFT
#define DSPI_MCR_CONT_SCKE_WIDTH             DSPI_MSC_MCR_CONT_SCKE_WIDTH
#define DSPI_MCR_CONT_SCKE(x)                DSPI_MSC_MCR_CONT_SCKE(x)

#define DSPI_MCR_MSTR_MASK                   DSPI_MSC_MCR_MSTR_MASK
#define DSPI_MCR_MSTR_SHIFT                  DSPI_MSC_MCR_MSTR_SHIFT
#define DSPI_MCR_MSTR_WIDTH                  DSPI_MSC_MCR_MSTR_WIDTH
#define DSPI_MCR_MSTR(x)                     DSPI_MSC_MCR_MSTR(x)
/*! @} */

/*! @name TCR - Transfer Count Register */
/*! @{ */

#define DSPI_TCR_SPI_TCNT_MASK               DSPI_MSC_TCR_SPI_TCNT_MASK
#define DSPI_TCR_SPI_TCNT_SHIFT              DSPI_MSC_TCR_SPI_TCNT_SHIFT
#define DSPI_TCR_SPI_TCNT_WIDTH              DSPI_MSC_TCR_SPI_TCNT_WIDTH
#define DSPI_TCR_SPI_TCNT(x)                 DSPI_MSC_TCR_SPI_TCNT(x)
/*! @} */

/*! @name CTAR - Clock and Transfer Attributes Register (In Master Mode) */
/*! @{ */

#define DSPI_CTAR_BR_MASK                    DSPI_MSC_CTAR_BR_MASK
#define DSPI_CTAR_BR_SHIFT                   DSPI_MSC_CTAR_BR_SHIFT
#define DSPI_CTAR_BR_WIDTH                   DSPI_MSC_CTAR_BR_WIDTH
#define DSPI_CTAR_BR(x)                      DSPI_MSC_CTAR_BR(x)

#define DSPI_CTAR_DT_MASK                    DSPI_MSC_CTAR_DT_MASK
#define DSPI_CTAR_DT_SHIFT                   DSPI_MSC_CTAR_DT_SHIFT
#define DSPI_CTAR_DT_WIDTH                   DSPI_MSC_CTAR_DT_WIDTH
#define DSPI_CTAR_DT(x)                      DSPI_MSC_CTAR_DT(x)

#define DSPI_CTAR_ASC_MASK                   DSPI_MSC_CTAR_ASC_MASK
#define DSPI_CTAR_ASC_SHIFT                  DSPI_MSC_CTAR_ASC_SHIFT
#define DSPI_CTAR_ASC_WIDTH                  DSPI_MSC_CTAR_ASC_WIDTH
#define DSPI_CTAR_ASC(x)                     DSPI_MSC_CTAR_ASC(x)

#define DSPI_CTAR_CSSCK_MASK                 DSPI_MSC_CTAR_CSSCK_MASK
#define DSPI_CTAR_CSSCK_SHIFT                DSPI_MSC_CTAR_CSSCK_SHIFT
#define DSPI_CTAR_CSSCK_WIDTH                DSPI_MSC_CTAR_CSSCK_WIDTH
#define DSPI_CTAR_CSSCK(x)                   DSPI_MSC_CTAR_CSSCK(x)

#define DSPI_CTAR_PBR_MASK                   DSPI_MSC_CTAR_PBR_MASK
#define DSPI_CTAR_PBR_SHIFT                  DSPI_MSC_CTAR_PBR_SHIFT
#define DSPI_CTAR_PBR_WIDTH                  DSPI_MSC_CTAR_PBR_WIDTH
#define DSPI_CTAR_PBR(x)                     DSPI_MSC_CTAR_PBR(x)

#define DSPI_CTAR_PDT_MASK                   DSPI_MSC_CTAR_PDT_MASK
#define DSPI_CTAR_PDT_SHIFT                  DSPI_MSC_CTAR_PDT_SHIFT
#define DSPI_CTAR_PDT_WIDTH                  DSPI_MSC_CTAR_PDT_WIDTH
#define DSPI_CTAR_PDT(x)                     DSPI_MSC_CTAR_PDT(x)

#define DSPI_CTAR_PASC_MASK                  DSPI_MSC_CTAR_PASC_MASK
#define DSPI_CTAR_PASC_SHIFT                 DSPI_MSC_CTAR_PASC_SHIFT
#define DSPI_CTAR_PASC_WIDTH                 DSPI_MSC_CTAR_PASC_WIDTH
#define DSPI_CTAR_PASC(x)                    DSPI_MSC_CTAR_PASC(x)

#define DSPI_CTAR_PCSSCK_MASK                DSPI_MSC_CTAR_PCSSCK_MASK
#define DSPI_CTAR_PCSSCK_SHIFT               DSPI_MSC_CTAR_PCSSCK_SHIFT
#define DSPI_CTAR_PCSSCK_WIDTH               DSPI_MSC_CTAR_PCSSCK_WIDTH
#define DSPI_CTAR_PCSSCK(x)                  DSPI_MSC_CTAR_PCSSCK(x)

#define DSPI_CTAR_LSBFE_MASK                 DSPI_MSC_CTAR_LSBFE_MASK
#define DSPI_CTAR_LSBFE_SHIFT                DSPI_MSC_CTAR_LSBFE_SHIFT
#define DSPI_CTAR_LSBFE_WIDTH                DSPI_MSC_CTAR_LSBFE_WIDTH
#define DSPI_CTAR_LSBFE(x)                   DSPI_MSC_CTAR_LSBFE(x)

#define DSPI_CTAR_CPHA_MASK                  DSPI_MSC_CTAR_CPHA_MASK
#define DSPI_CTAR_CPHA_SHIFT                 DSPI_MSC_CTAR_CPHA_SHIFT
#define DSPI_CTAR_CPHA_WIDTH                 DSPI_MSC_CTAR_CPHA_WIDTH
#define DSPI_CTAR_CPHA(x)                    DSPI_MSC_CTAR_CPHA(x)

#define DSPI_CTAR_CPOL_MASK                  DSPI_MSC_CTAR_CPOL_MASK
#define DSPI_CTAR_CPOL_SHIFT                 DSPI_MSC_CTAR_CPOL_SHIFT
#define DSPI_CTAR_CPOL_WIDTH                 DSPI_MSC_CTAR_CPOL_WIDTH
#define DSPI_CTAR_CPOL(x)                    DSPI_MSC_CTAR_CPOL(x)

#define DSPI_CTAR_FMSZ_MASK                  DSPI_MSC_CTAR_FMSZ_MASK
#define DSPI_CTAR_FMSZ_SHIFT                 DSPI_MSC_CTAR_FMSZ_SHIFT
#define DSPI_CTAR_FMSZ_WIDTH                 DSPI_MSC_CTAR_FMSZ_WIDTH
#define DSPI_CTAR_FMSZ(x)                    DSPI_MSC_CTAR_FMSZ(x)

#define DSPI_CTAR_DBR_MASK                   DSPI_MSC_CTAR_DBR_MASK
#define DSPI_CTAR_DBR_SHIFT                  DSPI_MSC_CTAR_DBR_SHIFT
#define DSPI_CTAR_DBR_WIDTH                  DSPI_MSC_CTAR_DBR_WIDTH
#define DSPI_CTAR_DBR(x)                     DSPI_MSC_CTAR_DBR(x)
/*! @} */

/*! @name SR - Status Register */
/*! @{ */

#define DSPI_SR_POPNXTPTR_MASK               DSPI_MSC_SR_POPNXTPTR_MASK
#define DSPI_SR_POPNXTPTR_SHIFT              DSPI_MSC_SR_POPNXTPTR_SHIFT
#define DSPI_SR_POPNXTPTR_WIDTH              DSPI_MSC_SR_POPNXTPTR_WIDTH
#define DSPI_SR_POPNXTPTR(x)                 DSPI_MSC_SR_POPNXTPTR(x)

#define DSPI_SR_RXCTR_MASK                   DSPI_MSC_SR_RXCTR_MASK
#define DSPI_SR_RXCTR_SHIFT                  DSPI_MSC_SR_RXCTR_SHIFT
#define DSPI_SR_RXCTR_WIDTH                  DSPI_MSC_SR_RXCTR_WIDTH
#define DSPI_SR_RXCTR(x)                     DSPI_MSC_SR_RXCTR(x)

#define DSPI_SR_TXNXTPTR_MASK                DSPI_MSC_SR_TXNXTPTR_MASK
#define DSPI_SR_TXNXTPTR_SHIFT               DSPI_MSC_SR_TXNXTPTR_SHIFT
#define DSPI_SR_TXNXTPTR_WIDTH               DSPI_MSC_SR_TXNXTPTR_WIDTH
#define DSPI_SR_TXNXTPTR(x)                  DSPI_MSC_SR_TXNXTPTR(x)

