TEAM-RD0105/MasterProject/MasterModel/RD0105FirmwareModel_Config/RTD/include/S32K36_DSPI_MSC_WRAPPER.h
#define DSPI_DDR1_DESER_DATA_MASK            DSPI_MSC_DDR1_DESER_DATA_MASK
#define DSPI_DDR1_DESER_DATA_SHIFT           DSPI_MSC_DDR1_DESER_DATA_SHIFT
#define DSPI_DDR1_DESER_DATA_WIDTH           DSPI_MSC_DDR1_DESER_DATA_WIDTH
#define DSPI_DDR1_DESER_DATA(x)              DSPI_MSC_DDR1_DESER_DATA(x)
/*! @} */

/*! @name SSR1 - DSI Serialization Source Select Register 1 */
/*! @{ */

#define DSPI_SSR1_SS_MASK                    DSPI_MSC_SSR1_SS_MASK
#define DSPI_SSR1_SS_SHIFT                   DSPI_MSC_SSR1_SS_SHIFT
#define DSPI_SSR1_SS_WIDTH                   DSPI_MSC_SSR1_SS_WIDTH
#define DSPI_SSR1_SS(x)                      DSPI_MSC_SSR1_SS(x)
/*! @} */

/*! @name DIMR1 - DSI Deserialized Data Interrupt Mask Register 1 */
/*! @{ */

#define DSPI_DIMR1_MASK_MASK                 DSPI_MSC_DIMR1_MASK_MASK
#define DSPI_DIMR1_MASK_SHIFT                DSPI_MSC_DIMR1_MASK_SHIFT
#define DSPI_DIMR1_MASK_WIDTH                DSPI_MSC_DIMR1_MASK_WIDTH
#define DSPI_DIMR1_MASK(x)                   DSPI_MSC_DIMR1_MASK(x)
/*! @} */

/*! @name DPIR1 - DSI Deserialized Data Polarity Interrupt Register 1 */
/*! @{ */

#define DSPI_DPIR1_DP_MASK                   DSPI_MSC_DPIR1_DP_MASK
#define DSPI_DPIR1_DP_SHIFT                  DSPI_MSC_DPIR1_DP_SHIFT
#define DSPI_DPIR1_DP_WIDTH                  DSPI_MSC_DPIR1_DP_WIDTH
#define DSPI_DPIR1_DP(x)                     DSPI_MSC_DPIR1_DP(x)
/*! @} */

/*! @name CTARE - Clock and Transfer Attributes Register Extended */
/*! @{ */

#define DSPI_CTARE_DTCP_MASK                 DSPI_MSC_CTARE_DTCP_MASK
#define DSPI_CTARE_DTCP_SHIFT                DSPI_MSC_CTARE_DTCP_SHIFT
#define DSPI_CTARE_DTCP_WIDTH                DSPI_MSC_CTARE_DTCP_WIDTH
#define DSPI_CTARE_DTCP(x)                   DSPI_MSC_CTARE_DTCP(x)

#define DSPI_CTARE_FMSZE_MASK                DSPI_MSC_CTARE_FMSZE_MASK
#define DSPI_CTARE_FMSZE_SHIFT               DSPI_MSC_CTARE_FMSZE_SHIFT
#define DSPI_CTARE_FMSZE_WIDTH               DSPI_MSC_CTARE_FMSZE_WIDTH
#define DSPI_CTARE_FMSZE(x)                  DSPI_MSC_CTARE_FMSZE(x)
/*! @} */

/*! @name SREX - Status Register Extended */
/*! @{ */

#define DSPI_SREX_CMDNXTPTR_MASK             DSPI_MSC_SREX_CMDNXTPTR_MASK
#define DSPI_SREX_CMDNXTPTR_SHIFT            DSPI_MSC_SREX_CMDNXTPTR_SHIFT
#define DSPI_SREX_CMDNXTPTR_WIDTH            DSPI_MSC_SREX_CMDNXTPTR_WIDTH
#define DSPI_SREX_CMDNXTPTR(x)               DSPI_MSC_SREX_CMDNXTPTR(x)

#define DSPI_SREX_CMDCTR_MASK                DSPI_MSC_SREX_CMDCTR_MASK
#define DSPI_SREX_CMDCTR_SHIFT               DSPI_MSC_SREX_CMDCTR_SHIFT
#define DSPI_SREX_CMDCTR_WIDTH               DSPI_MSC_SREX_CMDCTR_WIDTH
#define DSPI_SREX_CMDCTR(x)                  DSPI_MSC_SREX_CMDCTR(x)

#define DSPI_SREX_RXCTR4_MASK                DSPI_MSC_SREX_RXCTR4_MASK
#define DSPI_SREX_RXCTR4_SHIFT               DSPI_MSC_SREX_RXCTR4_SHIFT
#define DSPI_SREX_RXCTR4_WIDTH               DSPI_MSC_SREX_RXCTR4_WIDTH
#define DSPI_SREX_RXCTR4(x)                  DSPI_MSC_SREX_RXCTR4(x)

#define DSPI_SREX_TXCTR4_MASK                DSPI_MSC_SREX_TXCTR4_MASK
#define DSPI_SREX_TXCTR4_SHIFT               DSPI_MSC_SREX_TXCTR4_SHIFT
#define DSPI_SREX_TXCTR4_WIDTH               DSPI_MSC_SREX_TXCTR4_WIDTH
#define DSPI_SREX_TXCTR4(x)                  DSPI_MSC_SREX_TXCTR4(x)
/*! @} */

/*! @name TSL - Time Slot Length Register */
/*! @{ */

#define DSPI_TSL_TS0_LEN_MASK                DSPI_MSC_TSL_TS0_LEN_MASK
#define DSPI_TSL_TS0_LEN_SHIFT               DSPI_MSC_TSL_TS0_LEN_SHIFT
#define DSPI_TSL_TS0_LEN_WIDTH               DSPI_MSC_TSL_TS0_LEN_WIDTH
#define DSPI_TSL_TS0_LEN(x)                  DSPI_MSC_TSL_TS0_LEN(x)

#define DSPI_TSL_TS1_LEN_MASK                DSPI_MSC_TSL_TS1_LEN_MASK
#define DSPI_TSL_TS1_LEN_SHIFT               DSPI_MSC_TSL_TS1_LEN_SHIFT
#define DSPI_TSL_TS1_LEN_WIDTH               DSPI_MSC_TSL_TS1_LEN_WIDTH
#define DSPI_TSL_TS1_LEN(x)                  DSPI_MSC_TSL_TS1_LEN(x)

#define DSPI_TSL_TS2_LEN_MASK                DSPI_MSC_TSL_TS2_LEN_MASK
#define DSPI_TSL_TS2_LEN_SHIFT               DSPI_MSC_TSL_TS2_LEN_SHIFT
#define DSPI_TSL_TS2_LEN_WIDTH               DSPI_MSC_TSL_TS2_LEN_WIDTH
#define DSPI_TSL_TS2_LEN(x)                  DSPI_MSC_TSL_TS2_LEN(x)

#define DSPI_TSL_TS3_LEN_MASK                DSPI_MSC_TSL_TS3_LEN_MASK
#define DSPI_TSL_TS3_LEN_SHIFT               DSPI_MSC_TSL_TS3_LEN_SHIFT
#define DSPI_TSL_TS3_LEN_WIDTH               DSPI_MSC_TSL_TS3_LEN_WIDTH
#define DSPI_TSL_TS3_LEN(x)                  DSPI_MSC_TSL_TS3_LEN(x)
/*! @} */

/*! @name TS_CONF - Time Slot Configuration Register */
/*! @{ */

#define DSPI_TS_CONF_TS0_MASK                DSPI_MSC_TS_CONF_TS0_MASK
#define DSPI_TS_CONF_TS0_SHIFT               DSPI_MSC_TS_CONF_TS0_SHIFT
#define DSPI_TS_CONF_TS0_WIDTH               DSPI_MSC_TS_CONF_TS0_WIDTH
#define DSPI_TS_CONF_TS0(x)                  DSPI_MSC_TS_CONF_TS0(x)

#define DSPI_TS_CONF_TS1_MASK                DSPI_MSC_TS_CONF_TS1_MASK
#define DSPI_TS_CONF_TS1_SHIFT               DSPI_MSC_TS_CONF_TS1_SHIFT
#define DSPI_TS_CONF_TS1_WIDTH               DSPI_MSC_TS_CONF_TS1_WIDTH
#define DSPI_TS_CONF_TS1(x)                  DSPI_MSC_TS_CONF_TS1(x)

#define DSPI_TS_CONF_TS2_MASK                DSPI_MSC_TS_CONF_TS2_MASK
#define DSPI_TS_CONF_TS2_SHIFT               DSPI_MSC_TS_CONF_TS2_SHIFT
#define DSPI_TS_CONF_TS2_WIDTH               DSPI_MSC_TS_CONF_TS2_WIDTH
#define DSPI_TS_CONF_TS2(x)                  DSPI_MSC_TS_CONF_TS2(x)

#define DSPI_TS_CONF_TS3_MASK                DSPI_MSC_TS_CONF_TS3_MASK
#define DSPI_TS_CONF_TS3_SHIFT               DSPI_MSC_TS_CONF_TS3_SHIFT
#define DSPI_TS_CONF_TS3_WIDTH               DSPI_MSC_TS_CONF_TS3_WIDTH
#define DSPI_TS_CONF_TS3(x)                  DSPI_MSC_TS_CONF_TS3(x)
/*! @} */

/*!
 * @}
 */ /* end of group DSPI_MSC_Register_Masks */

/*!
 * @}
 */ /* end of group DSPI_MSC_Peripheral_Access_Layer */
#define DSPI_MCR_FCPCS_MASK                      (0x4U)
#define DSPI_MCR_FCPCS_SHIFT                     (2U)
#define DSPI_MCR_FCPCS_WIDTH                     (1U)
#define DSPI_MCR_FCPCS(x)                        (((uint32_t)(((uint32_t)(x)) << DSPI_MCR_FCPCS_SHIFT)) & DSPI_MCR_FCPCS_MASK)

